cases/epSzGap/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.001 0 0);

boundaryField
{
    top
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    electrodes_exposed
    {
        type            noSlip;
    }
    electrodes_grounded
    {
        type            noSlip;
    }
    region0_to_dielectric
    {
        type            noSlip;
    }
    bottom
    {
        type            zeroGradient; 
    }
}


// ************************************************************************* //
