cases/epSzGap/0.org/ep0
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          epA0;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 2 -3 0 0 -1 0]; // [kg * m^2 /( s^3 A)]

internalField   uniform 0;

boundaryField
{
    electrodes_exposed        
    {    
        type            fixedValue;
        value           uniform 1; 
    }

    electrodes_grounded      
    {
        type            fixedValue;
        value           uniform  0;  
    }

    front     
    {
        type            empty; 
    }
   
    back 
    {
        type            empty;      
    }

    top
    {
        type            zeroGradient; 
    }
    
    bottom
    {
        type            zeroGradient; 
    }
    
    inlet
    {
        type            zeroGradient; 
    }
    
    outlet
    {
        type            zeroGradient; 
    }
    
    region0_to_dielectric
    {
        type            potentialCoupledBaffleMixed;
        value           $internalField;
        sigma           1.85;   
        Tnbr            ep0;
    }

}


// ************************************************************************* //
