cases/epSzGap/0.org/rhoC
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rhoC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 1 0 0 1 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    electrodes_exposed
    {
        type            zeroGradient;
    }
    electrodes_grounded
    {
        type            zeroGradient;
    }
    region0_to_dielectric
    {
        type            codedFixedValue;
        value           $internalField;
        
        name    rhoCDistribution;
        code
        #{
            
            const vectorField& Cf = patch().Cf();
            scalarField& field = *this;
            
            const scalar sigma = 0.5;
            const scalar mu = 5.625E-4;
            const scalar xgap = 5.0E-4;
            const scalar xref = 0.0105;

            forAll(Cf, faceI)
            {
                const scalar x = Cf[faceI][0];
                
                //const scalar z = Cf[faceI][2];
                

                field[faceI] = exp(-pow(((x-mu)/xref),2)/(2*pow(sigma,2)));
                //Gx4 = np.exp( -((x-0.005)/0.005)**2 / (2 * 0.5**2) )
 
                /*if ( x < xgap)
                {
                    field[faceI] = zeroGradient;
                }*/
                
            }
        #};
    }
    bottom
    {
        type            zeroGradient; 
    }
}


// ************************************************************************* //
