cases/epSzGap/system/dielectric/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/dielectric";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

gradSchemes
{
    default       Gauss linear;
}

divSchemes
{
    default         Gauss linear;
}


laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(epsD,epS0) Gauss linear corrected;
    laplacian(epsD,epS1) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}
// ************************************************************************* //
