cases/epSzGap/system/topoSetDictRegion
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    dielectric;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.05 -0.05 -1.0) (0.05 1.0e-6 1.0);
        }
    }
    
    {
        name    air;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.05 1.0e-6 -1.0) (0.05 0.05 1.0);
        }
    }
    
    {
        name    dielectric;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set dielectric;
        }
    }
    
        {
        name    air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set air;
        }
    }
);

// ************************************************************************* //
